<?php
header("Content-type: text/html; charset=utf-8");

$arr = [
    'Самарская область' => ['Самара', 'Тольятти', 'Сызрань', 'Кинель'],
    'Ростовская область' => ['Ростов-на-Дону', 'Таганрог', 'Новочеркасск', 'Азов', 'Гуково'],
    'Московская область' => ['Москва', 'Зеленоград', 'Клин'],
    'Ленинградская область' => ['Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт'],
    'Рязанская область' => ['Рязань', 'Касимов', 'Скопин', 'Сасово', 'Михайлов']
];
foreach ($arr as $key => $value) {
    echo $key . ':<br>';

    for($i = 0; $i < count($value); $i++) {
        if ($i < count($value) - 1) {
            echo $value[$i] . ', ';
        } else {
            echo $value[$i] . '<br>';
        }
    }

}